import React from 'react'
import Scroll from './scroll'

export default function ScrollPage() {
  return (
    <div>
      <p>此为自定义滚动条</p>
      <Scroll style={{ height: 100, width: 400 }}>
        <div style={{ height: 600, width: 600, backgroundColor: 'rgb(232, 216, 179)' }}>
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动 冬盾个 滚动 冬盾个 滚动 冬盾个 滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
        </div>
      </Scroll>
      <br />
      <br />
      <br />
      <p>此为内置的浏览器滚动条</p>
      <div style={{ height: 100, width: 400, overflow: 'scroll' }}>
        <div style={{ height: 600, width: 600, backgroundColor: 'rgb(232, 216, 179)' }}>
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
          <br />
                    滚动 冬盾个 滚动 滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动滚动 冬盾个 滚动
          <br />
        </div>
      </div>
    </div>
  );
}
